---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.Dispose
source: html/fa409733-2af6-a937-5907-3c39f0f318cf.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.Dispose Method

Releases all resources used by the RebarShapeDrivenAccessor

## Syntax (C#)
```csharp
public void Dispose()
```